[
    {
        "Domain": "AI/ML ",
        "Project Title": "Machine Learning-Based Spectral Unmixing of Vegetation Pixels in Crop Lands from Hyperspectral Satellite Imagery",
        "Project UID": "AM01",
        "Name of Professor ": "Soumyashree Kar",
        "Project Description": "Vegetation monitoring using hyperspectral satellite imagery has become a vital tool in understanding ecosystem health, agricultural productivity, and biodiversity conservation. However, mixed pixels in satellite images often blur the spectral signals of vegetation with other land cover types, making it challenging to accurately assess vegetation abundance and distribution. This research focuses on assessment of different machine learning (ML)-based spectral unmixing algorithms tailored for vegetation pixels. Students can employ unsupervised ML for identifying the cluster of similar vegetation patterns followed by algorithms to unmix mixed spectral signals, for accurately identifying vegetation components, and producing high-resolution abundance maps. Applications include precision agriculture, and climate change impact studies.",
        "Number of Students Required": "3",
        "Year of Study Criteria": "Students entering 4th/5th year",
        "CPI Eligibility Criteria": "none",
        "Prerequisites": "knowledge of (and interest in learning) hyperspectral remote sensing and Machine Learning",
        "Duration": "2 months",
        "Learning Outcome & Expectations from the students": "This research will utilize machine learning to address critical challenges in vegetation spectral unmixing, contributing to advancements in hyperspectral remote sensing, helping the students with hands-on experience with geospatial ML, one of the state-of-the-art technologies.",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "Each student - around 7-10 hours per week",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "BSBE",
        "Project Title": "Non-linear methods for biomechanical analysis of human balance and gait",
        "Project UID": "BB01",
        "Name of Professor ": "Neeta Kanekar",
        "Project Description": "The control of human biped stance and gait (walking), a system that is inherently unstable, is often modelled as an inverted pendulum. Time-varying characteristics of the body's centre of mass and centre of pressure displacements along with electrical activity of muscles (EMG) are key parameters used to quantify the control of balance during standing and walking. While linear analysis is undertaken as a standard approach, non-linear methods have much to offer for drawing physiologically meaningful interpretations. Recently, we have developed a new framework based on topological data analysis (TDA) for studying impaired gait in patients with neurodegenerative disorders. In this project, the focus will be to expand the application of TDA to characterize the control of standing balance in humans, in order to obtain a mechanistic understanding of postural instability and falls in older adults.",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8.5",
        "Prerequisites": "Strong background in mathematics and experience with programming.",
        "Duration": "Minimum duration: one full semester. Project may continue further for 1 to 1.5 years, if interest and commitment persists, with the potential for a journal publication.",
        "Learning Outcome & Expectations from the students": "The student will learn the biomechanics of human balance control and gait along with new cutting-edge mathematical tools under topological data analysis such as persistence homology and its application to biomedical data. ",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "8 to 10 hours per week.",
        "Any other expectation from the students": "Interested students may read this paper: https://ieeexplore.ieee.org/document/10779507\n"
    },
    {
        "Domain": "BSBE",
        "Project Title": "High throughput sequencing data analysis for identifying immune cells prognostic signature in Breast cancer",
        "Project UID": "BB02",
        "Name of Professor ": "Prakriti Tayalia",
        "Project Description": "Publicly available high throughput sequencing data of breast cancer patients will be analyzed after quality control and normalization. The level of immune cell infiltration, their transcriptomic signature and their relevance to patient prognosis will be studied. ",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Expertise in R programming language and using the same for handling large datasets",
        "Duration": "2 months",
        "Learning Outcome & Expectations from the students": "Interpretation of complex biological data and its application for development of immunotherapy strategies for cancer treatment",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "8-10 hrs",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CHEMISTRY",
        "Project Title": "Developing pedagogical demonstrations for quantum chemistry",
        "Project UID": "CH01",
        "Name of Professor ": "Amber Jain",
        "Project Description": "We will develop demonstrations to showcase interference. Primary sources will be light and sound to produce interference patterns in different situations. The outcome of the project will be physical demonstrations that can be executed in large classes, including first year courses.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "none",
        "Prerequisites": "Enthusiasm towards DIY approach",
        "Duration": "Full semester",
        "Learning Outcome & Expectations from the students": "Construction of physical pedagogical demonstrations for quantum chemistry that can be used in large classes.",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "30",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CHEMISTRY",
        "Project Title": "Visible light mediated heterogeneous catalysis",
        "Project UID": "CH02",
        "Name of Professor ": "Dr. Deepti Kalsi",
        "Project Description": "Heterogeneous photocatalysis has emerged as an effective catalytic system for achieving sustainable organic transformations under mild conditions. This approach is widely applied in wastewater treatment, industrial processes, and health-related applications. The focus of this project is on the synthesis and characterization of photocatalytic materials, followed by their application across various fields. Materials with moderate band gaps and low recombination rates have attracted significant attention due to their distinctive semiconducting and catalytic properties, making them ideal candidates for advanced photocatalytic applications.",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8.5",
        "Prerequisites": "Hand on experience in column chromatography",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "30",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CHEMISTRY",
        "Project Title": "Quantum Computing for Drug Discovery and Materials Informatics ",
        "Project UID": "CH03",
        "Name of Professor ": "Rahul Maitra",
        "Project Description": "Near-term quantum computing algorithms will be developed for general quantum chemical problems across system length scales. The developed software stack will involve shallow depth circuit implementation, error mitigation and AI/ML based post processing.   ",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8.5",
        "Prerequisites": "Programming knowledge in Python and basic familiarity with quantum mechanics and quantum computing",
        "Duration": "2 months",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "30-35 hours",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CHEMISTRY",
        "Project Title": "Electrochemical Extraction of Li from seawater",
        "Project UID": "CH04",
        "Name of Professor ": "Srinivasan Ramakrishnan",
        "Project Description": "Li-ion batteries for electric vehicles and grid-scale storage constitute a multibillion dollar global industry. However, lithium extraction from brines is limited to certain geographical locations in the world, and is highly energy and water-intensive. Seawater on the other hand, is an infinite resource of lithium. The key challenge, however, lies in separating lithium (200 ppm) from sodium (~23000 ppm).\n\nOur lab is working on an innovating electrochemical approach to separate lithium from sodium in a mixed electrolyte stream. We have promising preliminary data generated as part of a DD project. I am looking for 1-2 highly motivated students to develop the process technology further. ",
        "Number of Students Required": "1-2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8.5",
        "Prerequisites": "a) Strong motivation to work in deep tech, b) entrepreneurial mindset, c) strong technical track record. Some basic knowledge of electrochemistry (coursework/project etc.) would be a bonus.",
        "Duration": "3 months to 6 months (extendable if needed)",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "40",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CHEMICAL",
        "Project Title": "Li-ion battery Post Morterm Analysis",
        "Project UID": "CL01",
        "Name of Professor ": "Bharatkumar suthar",
        "Project Description": "Method Development for opening up Li-ion battery",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "hands on work",
        "Duration": "3 Months.",
        "Learning Outcome & Expectations from the students": "Li-ion battery ",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "50",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CHEMICAL",
        "Project Title": "Degradation of polyethylene and PET to form micro and nanoplastics",
        "Project UID": "CL02",
        "Name of Professor ": "Guruswamy Kumaraswamy",
        "Project Description": "The student will use accelerated degradation methods developed in our laboratory to investigate the degradation of nets of polyethylene and PET, to form micro/nanoplastics. This is an experimental project and will involve performing the polymer degradation experiments and also learning several characterization tools to characterize the products. ",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year",
        "CPI Eligibility Criteria": "none",
        "Prerequisites": "None",
        "Duration": "2 months",
        "Learning Outcome & Expectations from the students": "This project will involve learning about plastics, routes to degradation of plastics as well as how to analyze the resultant products. The student will work closely with a PhD student who will supervise his/her day to day experimental work. The student will be exposed to experimental research and will learn how to write a report.",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "40+",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CHEMICAL",
        "Project Title": "CO2 capture and conversion system",
        "Project UID": "CL03",
        "Name of Professor ": "Abhijit Chatterjee",
        "Project Description": "The goal of this project is to design a system for capturing and converting CO2 to other useful products. The first step will involve capture of CO2 using an absorber which will be designed by the student working on the project. The second step will involve electrochemical conversion of the capture CO2. Since the second step has already been implemented in our group, the student will have to integrate the absorber to the electrochemical reactor.",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Students interested should discuss with me so that they can get feedback about the suitability of the project.",
        "Duration": "4 months",
        "Learning Outcome & Expectations from the students": "Design of absorber columns",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "10 hours",
        "Any other expectation from the students": "Students will have to spend time in lab and work under the supervision of senior students already working on related aspects."
    },
    {
        "Domain": "CLIMATE STUDIES",
        "Project Title": "Climate Engineering: The Good, the Bad, and the Ugly – Implications for the Indian Climate",
        "Project UID": "CM01",
        "Name of Professor ": "Angshuman Modak",
        "Project Description": "Climate engineering strategies or geoengineering refers to deliberate large-scale interventions in the Earth's climate system to counteract global warming. While such interventions—especially solar radiation modification (SRM) and carbon dioxide removal (CDR)—are increasingly studied globally, their specific implications for India's climate  remain underexplored. This internship will critically examine the science, potential benefits, and risks of climate engineering in the Indian context. Focus areas include regional impacts on monsoon and extreme events and insights from model simulations (e.g., GeoMIP). ",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Mandatory Skills: \nStrong analytical foundation in applied Physics and Mathematics.\nProficiency in Python or MATLAB is essential.\nExperience in data analysis and handling large datasets (e.g., NetCDF, HDF).\nComfort working in Linux/Unix environments for climate data processing.\n\nDesirable Skills:\nExposure to AI/ML techniques climate data.\nFamiliarity with climate model outputs (e.g., CMIP6) or reanalysis datasets.\nAbility to visualize spatial and temporal patterns in large-scale geoscientific datasets.",
        "Duration": "2-12 months. If interested can be continued until the project ends.",
        "Learning Outcome & Expectations from the students": "Understand the scientific basis of Climate engineering strategies and their relevance to Indian Climate. Assess impacts on monsoon and extremes. Analyze climate model outputs and large datasets using Python/MATLAB. Gain exposure to data-driven methods and simple climate models relevant for studying Earth system behavior. Develop and communicate findings through technical writing and presentations",
        "Student required to stay on campus:": "Partially Yes",
        "Weekly Time Commitment": "12",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CLIMATE STUDIES",
        "Project Title": "Assessment of demand-side climate mitigation strategies",
        "Project UID": "CM02",
        "Name of Professor ": "Anjali Sharma",
        "Project Description": "The aim of this project is to examine how energy demand reduction measures can contribute to climate change mitigation. Absolute reduction in energy demand is gaining attention as a climate mitigation strategy. Although demand-side management of energy is not a new mitigation solution, it primarily focuses on the relative reduction in energy demand via efficiency improvements. This can be done by limiting energy demand using a mix of technological innovation, and social & institutional changes. \n\nBut, the feasibility of achieving such high levels of efficiency improvements remains questionable as the study assumes historically unprecedented rates of improvements that are also prohibitively expensive (Semienuik et al., 2020). In this context, mitigation strategies focused on reducing absolute energy demand are gaining traction. These include ‘Degrowth’(Kallis et al., 2018) and ‘Energy Sufficiency’ (Darby and Fawcett, 2018). These strategies highlight a shift away from the dominant climate mitigation discussions that assume a continued growth in GDP and thus energy use to the ones where the overall GDP and energy levels are limited to levels that are enough for human well-being. \n\nThis project will assess the ambition and feasibility of the emerging degrowth and sufficiency focused climate mitigation strategies, and their implications for human well-being and equitable climate mitigation. Scenarios assessed for the Intergovernmental Panel on Climate Change (IPCC) SR1.5 and AR6 reports, as well as other secondary literature will be analysed in this project.\n",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Proficiency with one of the coding languages",
        "Duration": "2 months",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "10",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "COMPUTER SCIENCE",
        "Project Title": "Measurement of 4G/5G/WiFi network stability",
        "Project UID": "CS01",
        "Name of Professor ": "Bhaskaran Raman",
        "Project Description": "We often experience poor network conditions due to which voice/video conversations are patchy. This measurement project will aim to quantify how often such poor network conditions happen in practice, and the extent to which they happen. The work will involve using existing open source tools as well building new ones, to measure metrics such as network capacity (throughput), round-trip-delay, jitter (variability in delay), packet loss rate, burstiness of loss, etc.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7.5",
        "Prerequisites": "Good score in UG computer networks course, data structures and programming courses, proficiency in programming helps, familiarity with Android and django-python is a plus",
        "Duration": "3-6 months",
        "Learning Outcome & Expectations from the students": "Understanding of networking concepts, network programming, tools and techniques for network measurements",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "40 hours per week",
        "Any other expectation from the students": "Should take initiative in making progress and updating supervisor if stuck, commitment to high quality usable/reusable software, methodical and regular work, regularity in reporting/updating"
    },
    {
        "Domain": "COMPUTER SCIENCE",
        "Project Title": "Develop STS India Network portal with user authentication",
        "Project UID": "CS02",
        "Name of Professor ": "Mahendra Shahare",
        "Project Description": "Science and Technology Studies India Network is an academic community and has a basic functional website. Your task is to scale it to a full fledged portal with user authentication system, public and access defined content for the site. Integrate with Youtube and host podcast feature. Possibly also integrate payment systems to work with UPI/Indian banks. Auto generated membership emails, list server etc.",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 5",
        "Prerequisites": "Good programming skills for web portal development",
        "Duration": "2 months",
        "Learning Outcome & Expectations from the students": "Skills for web development and content organisation.",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "10 hrs",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "COMPUTER SCIENCE",
        "Project Title": "Maharashtra Drone Mission",
        "Project UID": "CS03",
        "Name of Professor ": "Ganesh Ramakrishnan",
        "Project Description": "The Maharashtra Drone Mission is an ambitious initiative launched by the Government of Maharashtra to position the state as a global leader in drone technology. This mission aims to foster indigenous research, development, and commercialization of drone and allied technologies, leveraging the expertise of academic institutions, R&D institutes, industries, government, and the youth. The initiative will focus on establishing drone centres, developing a safe and reliable autonomous drone ecosystem, and advancing counter-drone technology. Additionally, it will support start-up incubation, training, outreach programs, and the development of a supportive regulatory framework. The mission seeks to create jobs, drive economic growth, and generate revenue, ensuring long-term self-sustainability.\nBy integrating advanced artificial intelligence (AI) and video analytics, the Maharashtra Drone Mission plans to enhance the capabilities of unmanned aerial vehicles (UAVs), making them more effective and versatile. These innovations include intelligent surveillance, real-time object identification, swarm UAV technology, and advanced autonomous features such as self-charging and coordinated payload lifting. This project represents a significant step towards a technologically advanced and self-reliant Maharashtra, with widespread applications in both urban and rural settings.",
        "Number of Students Required": "5",
        "Year of Study Criteria": "Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 6",
        "Prerequisites": "The current lot of unmanned platforms can scan the immediate environment for predefined parameters and take actions as per some predetermined algorithm. We plan to go beyond that and develop human-like capabilities in UAVs to enhance the effectiveness of each platform. This capability being developed will be platform agnostic and can be used to improve the overall effectiveness of UAVs. Some illustrations of the capabilities that we plan to develop for UAVs with their designated flying zone (or perimeter) by UAVs through AI and video analytics-based intelligent surveillance of every corner of the area through the feed received from cameras are:\nIdentify the difference between a boy holding a toy gun and a man having an actual weapon.\nIdentity difference between a terrorist holding someone hostage and two terrorists working together\nIdentify if someone is acting suspiciously and take a call to investigate further.\nIdentify if someone is dead or alive and needs immediate medical help\nTrack someone in a covert manner or spy on some terrorist secretly using a swarm framework of UAVs\nApart from the intelligence as mentioned earlier features, human-like intelligence using drones is also envisioned to lead to some important technologies aimed at improving the performance and safety of the platform, necessary to make the overall drone system employable in various applications, as follows:\nPerimeter monitoring using Video analytics on UAVs\nReal-time object identification in resource-constrained UAV settings",
        "Duration": "5 years",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "40 hrs/week",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "COMPUTER SCIENCE",
        "Project Title": "Temporal Fusion Transformer (TFT) model development for ChatGPT based AI applications",
        "Project UID": "CS04",
        "Name of Professor ": "Prof Sandip Mondal",
        "Project Description": "ChatGPT is built on OpenAI's proprietary series of generative pre-trained transformer (GPT) models and is fine-tuned for conversational applications using a combination of supervised learning and reinforcement learning from human feedback. This project amis to develop trained transformer model which will be used different applications starting from stock market analysis, income tax calculations etc.",
        "Number of Students Required": "4",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8.5",
        "Prerequisites": "Highly motivated, Very strong coading expertise",
        "Duration": "1 Year",
        "Learning Outcome & Expectations from the students": "Starting startups",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "20 Hrs",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "COMPUTER SCIENCE",
        "Project Title": "Fairness in high frequency trading",
        "Project UID": "CS05",
        "Name of Professor ": "Swaprava Nath",
        "Project Description": "HFT is a classic example of algorithms in practice. While there are many regulations, it is not completely clear whether all of them are provably fair. This paper (https://www.jstor.org/stable/23433669?seq=1) from 2013 asks this question and formulates some of the axioms. But it is unclear how formal such fairness notions are and there isn't much follow-up work. A good survey of the literature on fairness in HFT will be good to begin with. With our knowledge of axiomatic fairness, it may be possible to formulate these questions better. Relevant paper for theoretical investigation: https://arxiv.org/pdf/2410.07023",
        "Number of Students Required": "1-2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "CS6001 (mandatory) CS6002 (optional) -- independent study would also be fine, but the student should be prepared with the knowledge of these topics before the start of the project.\n\nCS6001: https://www.cse.iitb.ac.in/~swaprava/cs6001_07_2024.html\nCS6002: https://www.cse.iitb.ac.in/~swaprava/cs6002_01_2025.html",
        "Duration": "3 months, extendable to a semester long BTP.",
        "Learning Outcome & Expectations from the students": "mechanism design and its application to one of the most sought-after financial technologies of the recent time, high frequency trading.",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "28",
        "Any other expectation from the students": "enjoy the process rather than the outcome."
    },
    {
        "Domain": "COMPUTER SCIENCE\n",
        "Project Title": "Developing and integrating a simulation environment with a real vehicular testbed for Connected Autonomous Vehicle testing in Indian Traffic Conditions",
        "Project UID": "CS06",
        "Name of Professor ": "Prof. Archak Mittal",
        "Project Description": "This project aims to develop and integrate a simulation environment, replicating the complexities of Indian traffic conditions, with a real, scaled vehicular testbed. The scaled vehicles will operate based on control algorithms and localization techniques. The interactions between simulated and real vehicles will allow for creating a mixed reality environment for rigorous testing and validation of Connected Autonomous Vehicle algorithms.",
        "Number of Students Required": "4",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Experience with ROS, Embedded Systems Programming, Python, MATLAB",
        "Duration": "6 months",
        "Learning Outcome & Expectations from the students": "Students will gain experience and practical skills in robotics, simulation, embedded systems, and experimental validation of ADAS and control systems algorithms.",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "30-40 hours per week",
        "Any other expectation from the students": "Students must be diligent and hardworking with consistent efforts. They should demonstrate initiative in learning and problem-solving while providing regular progress updates. Thorough documentation of their work, culminating in a comprehensive final report in WORD format, is required."
    },
    {
        "Domain": "COMPUTER SCIENCE ",
        "Project Title": "Research Group Website Development",
        "Project UID": "CS07",
        "Name of Professor ": "Ankit Jain",
        "Project Description": "We want to revive our group website and make it more interactive.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 2nd year",
        "CPI Eligibility Criteria": "above 6",
        "Prerequisites": "basic experience with html/css, etc",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "3",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CTARA",
        "Project Title": "Geospatial mapping of mini-grids in India",
        "Project UID": "CT01",
        "Name of Professor ": "Anand B. Rao",
        "Project Description": "Minigrids play an important role in providing reliable electricity supply in remote rural areas. This project aims to create a detailed map of mini-grids across the country. By pinpointing the locations, capacities, technologies, and operational status of these decentralised energy systems, the project aims to provide critical insights for policymakers, developers, and stakeholders. The mapping process may use advanced geospatial tools and data analytics to identify underserved regions and facilitate targeted interventions to enhance energy planning and investment strategies. Ultimately, this comprehensive mapping effort will support India's goal of achieving universal energy access while promoting a sustainable clean energy transition.",
        "Number of Students Required": "1-2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 6.5",
        "Prerequisites": "Basic knowledge of distributed renewable energy and mapping tools",
        "Duration": "6 weeks",
        "Learning Outcome & Expectations from the students": "•\tUnderstanding Mini-grids and their Distribution: Gain insights into the geographic distribution, capacity, and operational status of mini-grids across India.\n\n•\tIdentifying Energy Access Gaps: Learn to analyse data to identify underserved or unserved regions where mini-grids can play a critical role in improving electricity access.\n\n•\tData Collection and Analysis Skills: Develop skills in using geospatial tools, satellite imagery, and field surveys for mapping and analyzing energy infrastructure.\n\n•\tPolicy and Planning Insights: Understand how mapping data can inform energy policies, investment strategies, and rural electrification programs.\n",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "30 hours per week",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CTARA",
        "Project Title": "Comparative Analysis of Lead Acid and Lithium-ion Batteries for Mini Grid Applications",
        "Project UID": "CT02",
        "Name of Professor ": "Anand B. Rao",
        "Project Description": "Minigrids play an important role in providing reliable electricity supply in remote rural areas. This project aims to comprehensively compare lead acid and lithium-ion batteries in mini grid applications, focusing on their economic, environmental, and operational performance. The analysis will evaluate key factors such as cost-effectiveness, lifespan, efficiency, and environmental impact. By assessing real-world case studies and industry trends, this project seeks to provide insights into the suitability of each battery type for mini grid systems, helping stakeholders make informed decisions about energy storage solutions.",
        "Number of Students Required": "1-2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 6.5",
        "Prerequisites": "Basic knowledge of mini-grids, battery technologies, and economics is mandatory",
        "Duration": " 6 weeks",
        "Learning Outcome & Expectations from the students": "•\tCompare Technical Specifications: Understand efficiency, lifespan, and energy density differences.\n\n•\tEvaluate Economic Feasibility: Calculate NPV and IRR to assess investment viability.\n\n•\tAnalyze Environmental Impacts: Consider disposal and recycling challenges.\n\n•\tDevelop Best Practices: Recommend optimal battery selection based on project needs",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "30 hours per week  ",
        "Any other expectation from the students": "nil "
    },
    {
        "Domain": "ELECTRICAL",
        "Project Title": "Fabrication of a detector array for rapid, spatially resolved,  large area measurements of non uniformity of light intensity measurements on a surface",
        "Project UID": "EE01",
        "Name of Professor ": "Anil Kottantharayil",
        "Project Description": "This project envisages using a 5x8 array of silicon solar cells (1cm2) to measure the illuminance of a light source illuminating a plane of 21cm x21 cm. This requires making the array and designing a circuit with switches/relays to sequentially switch each detector and measure the illuminance by measuring the short circuit current of each solar cell in the array using an aurdino for both switching and data acquisition.\nStudent Takeaways: \n how to use solar cells as light detectors and calibration of each detector for absolute intensity.\nIntegrating the array – making a PCB and interfacing with an aurdino.",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 3rd year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Knowledge of aurdino programming, and prior exposure to electronic circuits. ",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "How to use solar cells as light detectors and calibration of each detector for absolute intensity. Integrating the array of solar cells, making a PCB and interfacing with an aurdino.",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "10 hours",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "ELECTRICAL",
        "Project Title": "Simulation and construction of a two colour light source for photoluminescence imaging of si/perovskite tandem solar cells",
        "Project UID": "EE02",
        "Name of Professor ": "Anil Kottantharayil",
        "Project Description": "The first part of the project is to carry out a simulation of a light source for photoluminescence studies of si/perovskite tandems and verifying the simulations by constructing a small light source. The project envisages use of 660nm and 850 nm led. Optimisation of the array for high uniformity of the illuminance on the sample (uniformity better than 5%) and building the array to qualify it is part of the project. This will serve as a precursor for the design of a 50 mm x 50mm illuminance surface.",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 3rd year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "C/Matlab/python coding",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "Calculation of the illuminace for a light consisting of an array of discrete sources, construction of an array , and measurement of the illuminance",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "10",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "ELECTRICAL",
        "Project Title": "Monitoring and control of ventilation and cooling systems ",
        "Project UID": "EE03",
        "Name of Professor ": "Anupama Kowli",
        "Project Description": "Students will be involved in experiments pertaining to monitoring and control of IITB classrooms to improve air quality and thermal comfort at minimal energy expense. Sensor deployment, data collection and data-driven control will be explored for testing interventions. Three classrooms are currently instrumented with the sensors and will be used for experiments. ",
        "Number of Students Required": "3",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Some prior hardware/sensors/robotics experience would be desirable",
        "Duration": "3 to 6 months",
        "Learning Outcome & Expectations from the students": "Applications of data driven control\nIntroduction to simulation and modeling\nPractical deployment opportunities",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "10",
        "Any other expectation from the students": "Initiative and leadership skills, ability to work in groups, strong communication skills."
    },
    {
        "Domain": "ELECTRICAL",
        "Project Title": "Symbol detection in large multiple input multiple output (MIMO) wireless communication systems using CMOS + X oscillator Ising machines (OIM",
        "Project UID": "EE04",
        "Name of Professor ": "Debanjan Bhowmik",
        "Project Description": "Coupled oscillator arrays (also known as oscillatory neural networks (ONN)) have been shown to act as Ising machines and thereby heuristic solvers for solving different kinds of computationally NP-hard optimization problems. Through this project, we plan to design, simulate, and later fabricate, and experimentally implement CMOS + X (X being emerging non-volatile memory (NVM) devices used for coupling between oscillators) oscillator Ising machine (OIM) chips to solve the symbol detection problem in multiple input multiple output (MIMO) wireless communication systems, which when solved through maximum likelihood detection technique has also been shown to be a NP-hard problem. The proposed OIM attempts to solve the decoding problem by heuristically solving the maximum likelihood detection problem. The project involves work cutting across a lot of disciplines: computer science: algorithms, machine learning and optimization; physics: non-linear dynamics, materials and devices; electronics/ electrical engineering: analog circuit design, digital/ FPGA emulator design, wireless communication. So, we would like to have students from different departments joining in the project and bringing in their individual domain knowledge and interests for the benefit of the project. ",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "The project involves work cutting across a lot of disciplines: computer science/ algorithms, machine learning and optimization, analog circuit design, digital/ FPGA emulator design, materials and devices, wireless communication. The students who want to work in the project should have some knowledge and interest in at least one (or preferably two) of the above topics. ",
        "Duration": "2 months (can extend to BTech or MTech or Dual Degree project thesis)",
        "Learning Outcome & Expectations from the students": "1.\tDevelopment of oscillator Ising machine (OIM) algorithms for symbol detection in large multiple input multiple output (MIMO) wireless communication systems \n2.\tCMOS-based OIM chip design and subsequent tape-out to solve the MIMO decoding problem \n3.\tDevelopment of emerging non-volatile memory (NVM) devices as coupling elements between oscillators and development of CMOS + X Ising machines\n4.  The students working in this project will develop proficiency in at least two of the above topics: non-linear dynamics, optimization algorithms, wireless communication, analog circuit design, materials and devices",
        "Student required to stay on campus:": "Preferably yes, but not compulsory since a lot of the work involves coding that can be done from elsewhere with good internet access.",
        "Weekly Time Commitment": "30",
        "Any other expectation from the students": "The students are expected to continue this work for BTech, Mtech and Dual Degree thesis under my supervision. "
    },
    {
        "Domain": "ELECTRICAL",
        "Project Title": "Programming STM32 for control of India's first compliant mechanism based 3D printer",
        "Project UID": "EE05",
        "Name of Professor ": "Prasanna Gandhi",
        "Project Description": "We have been developed technology and machines for 3D printing at microscale based on SLA method. Productization of the same for the first version Spanda 1 is underway. It incorporates 3 granted patents. As a part of the productization embedded hardware boards have been developed for control of various axes with a unique architecture. Part of programming interfaces is already done. This project involves further programming and testing coordinated motions and actual printing of the 3D components. All mechanical hardware is already in place. ",
        "Number of Students Required": "2 (students with background in STM 32 microcontrollers)",
        "Year of Study Criteria": "Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Background in programming different interfaces of STM 32 microcontroller",
        "Duration": "60 days",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "40",
        "Any other expectation from the students": "sincerity and ethics"
    },
    {
        "Domain": "ELECTRICAL",
        "Project Title": "Hardware Security in 3D NAND flash memory technology",
        "Project UID": "EE06",
        "Name of Professor ": "Prof Sandip Mondal",
        "Project Description": "The 3-D NAND flash device has become an essential fragment of the cyber-physical systems to manage the enormous data bang in the era of the Internet of Things (IoT). Moreover, hardware security primitives such as physical unclonable function (PUF) have become crucial in the functional circuits of these cyber-physical systems for defense in contradiction of security susceptibilities and adversary attacks.",
        "Number of Students Required": "3",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8.5",
        "Prerequisites": "High skill Python",
        "Duration": "1",
        "Learning Outcome & Expectations from the students": "3D NAND flash memory for Artificial Intelligence, Patent and International (USA) presentation",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "20 Hrs",
        "Any other expectation from the students": "https://www.youtube.com/watch?v=45HAfu719iw"
    },
    {
        "Domain": "ELECTRICAL",
        "Project Title": "Mixed signal control electronics design",
        "Project UID": "EE07",
        "Name of Professor ": "Veeresh Deshpande",
        "Project Description": "The project involves design of PCB with mixed signal circuits comprising of ADCs, DACs, Op-amps etc. The board is needed control scanning tunneling microscope stage. The electronics board can be FPGA based or microcontroller based to perform fast collection of data from ADCs and supply voltage to DACs.\n\nAnother project involves improving an existing board for memory chip measurements. The design should improve the speed of measurement with advanced ADCs, DACs etc.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8.5",
        "Prerequisites": "PCB design, analog circuit design",
        "Duration": "6 months",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "20",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "ENERGY",
        "Project Title": "Redox flow batteries",
        "Project UID": "EN01",
        "Name of Professor ": "Manoj Neergat",
        "Project Description": "Project Description \n\nThis project aims to investigate different redox-active species to enhance the overall performance of redox flow batteries (RFBs). RFBs offer a distinct advantage in energy storage by decoupling energy capacity from power output. In RFBs, energy is stored in external electrolyte tanks, while the electrochemical reactions occur in a separate flow cell. The focus is to explore various redox systems and their electrochemical properties to improve energy density, power density, and cost-effectiveness of RFBs. These redox couples will be electrochemically characterized using a three-electrode setup through techniques such as cyclic voltammetry (CV), electrochemical impedance spectroscopy (EIS), chronoamperometry, and chronopotentiometry. Through electrochemical investigation and kinetic analysis, the project aims to contribute to the development of RFBs with improved efficiency. \n\n ",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "none",
        "Prerequisites": "Nil",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "Characterization of electrochemical systems and device fabrication",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "35 h",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "ENVIRONMENTAL STUDIES",
        "Project Title": "Weather forecasting to support air quality modelling",
        "Project UID": "ENV01",
        "Name of Professor ": "Srinidhi Balasubramanian",
        "Project Description": "WRF model is widely implemented to generate gridded weather fields as input to chemical transport models (CTM). This project will (i) generate multi-high spatial resolution weather fields for India, (ii) evaluate accuracy and scale-specific responses in comparison to ground based monitoring stations and other data products, (iii) integrate the model outputs into a CTM, and (iv) evaluate outcomes for wet and dry deposition when gridded CTM outputs are obtained.",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7.5",
        "Prerequisites": "Experience with weather models or earth systems, air quality models",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "1. Hands on application of a weather model\n2. Fundamental understanding of atmospheric processes\n3. Literature understanding of air pollution model studies in India",
        "Student required to stay on campus:": "Hybrid, with remote access to resources in PI lab",
        "Weekly Time Commitment": "20-40 hours",
        "Any other expectation from the students": "TImely communication, elaborate documentation for weekly progress reporting."
    },
    {
        "Domain": "EARTH SCIENCES",
        "Project Title": "Asteroids, Volcanoes, and Dinosaur Wars: Unpacking a science controversy through publication data analysis",
        "Project UID": "ES01",
        "Name of Professor ": "JAHNAVI PUNEKAR",
        "Project Description": "This project explores the enduring scientific controversy over the causes of dinosaur extinction—asteroidal impact versus volcanic activity—by analyzing trends in scientific publications. Using bibliometric and text-mining techniques, we investigate how support for competing hypotheses has shifted over time and whether publication patterns reveal biases shaped by disciplinary affiliation, journal impact, or citation networks. The study aims to uncover how scientific narratives gain dominance and how data reflect the social dynamics of science itself.",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8.5",
        "Prerequisites": "Data analytics, statistics",
        "Duration": "3 months but extendable",
        "Learning Outcome & Expectations from the students": "Develop critical thinking skills to evaluate scientific controversies.\n\nGain proficiency in bibliometric and data analysis techniques.\n\nLearn to synthesize and communicate research findings effectively.\n\nUnderstand the psychological, social and disciplinary factors influencing scientific consensus.\n\nPossibly one manuscript for submission if taken seriously.",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "3-5 hours, variable",
        "Any other expectation from the students": "Sincerity and motivation"
    },
    {
        "Domain": "MATHEMATICS",
        "Project Title": "Permutation polynomials",
        "Project UID": "MA01",
        "Name of Professor ": "Harish Pillai",
        "Project Description": "Polynomials over a finite field that evaluates to a permutation of the finite field are called permutation polynomials. The project involves studying properties of such polynomials. It would require the student to understand finite fields and for any meaningful push forward, would require a lot of experimentation using computers. So programs need to be written and results need to be collated and analysed.",
        "Number of Students Required": "1 - 2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "none",
        "Prerequisites": "It would be good if the person knows what a finite field is !! Knowing linear algebra well would be an advantage. ",
        "Duration": "A few months depending on interest",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "Ten hours",
        "Any other expectation from the students": "It is helpful if the student likes to solve puzzles. "
    },
    {
        "Domain": "BSBE\nMECHANICAL  ENINEERING\nMULTIDISCIPLINARY",
        "Project Title": "Flow visualization of cardio-vascular flow",
        "Project UID": "MD01",
        "Name of Professor ": "Manaswita Bose",
        "Project Description": "The aim of the project is to explore the in vitro measurement of fluid flow in prosthetic heart valves. Flow visualization experiments will be performed in 3D printed   mock circulatory loops.  The first challenge is to fabricate the set-up and then to establish the flow through the system.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year",
        "CPI Eligibility Criteria": "above 6",
        "Prerequisites": "Interest in experiments and fluid mechanics ",
        "Duration": "2 months",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "40",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "AI/ML\nBSBE\nMULTIDISCIPLINARY",
        "Project Title": "Topological data analysis in biological systems",
        "Project UID": "MD02",
        "Name of Professor ": "Debasish Chatterjee",
        "Project Description": "This project targets the analysis of signals arising from biological systems. While conventional techniques include the analysis of DNA sequences, protein structures, neural signals, etc., via methods broadly classifiable as “linear”, this project targets the employment of nonlinear tools of topological flavor applied to biological systems. These tools give insights into biological phenomena that are otherwise opaque to linear methods. Applications will range from disease diagnosis to understanding brain function, enhancing insights into complex biological systems and improving medical treatments.\n\nStudents will be expected to study and master the mathematical techniques, design algorithms and develop the corresponding software. Since the techniques are significantly deep, this project is not classifiable as short-term.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 2nd year",
        "CPI Eligibility Criteria": "above 8.5",
        "Prerequisites": "Sufficient mathematical maturity.",
        "Duration": "1-2 yr.",
        "Learning Outcome & Expectations from the students": "Exposure to cutting-edge applied topological tools for signal analysis and publications in top scientific venues.",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "20 during the summer vacation and at least 5 during the semester",
        "Any other expectation from the students": "I have little patience for not-too-serious students. If you're looking for quick outcomes, then please do *not* apply for this project. This work will require sustained focus and attention over at least 1 year."
    },
    {
        "Domain": "CHEMICAL\nAI/ML\nMULTIDISCIPLINARY",
        "Project Title": "How do data-driven machine learning models that generate stable structures compare against conventional methods?",
        "Project UID": "MD03",
        "Name of Professor ": "Sudarshan Vijay",
        "Project Description": "Data-driven machine learning models are increasingly being used to generate stable atomic configurations. These models are trained on a database of stable structures computed using density functional theory (DFT). Based on this database, architectures such as the variational auto-encoder, generative adversarial networks and (more recently) the transformer learn an implicit probability distribution. This distribution is used to decide if a given configuration is stable. \n\nIn contrast, conventional methods use global optimization techniques such as basin and minima hopping. These techniques traverse through the potential energy surface of a given atomic configuration while looking for stable (lowest energy) structures.\n\nIt is currently unclear if these data-driven machine learning models outperform conventional algorithms for the task of generating new stable structures for a fixed stoichiometry. In this work, we will apply available machine learning models as well as global optimization techniques to a few prototypical materials. We will benchmark stable structures generated by these methods and compare their time-to-solution.\n\nThis project is well suited for students interested in developing and applying machine learning models. Prior experience in DFT calculations and machine learning techniques is not required. Basic knowledge of programming will be useful but can be picked up during the project. ",
        "Number of Students Required": "3",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Basic knowledge of programming will be useful but can be picked up during the project. ",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "We will implement state-of-the-art machine learning methods for materials physics from scratch and analyze their performance.",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "5",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CHEMICAL\nAI/ML\nMULTIDISCIPLINARY",
        "Project Title": "Strategies for generating databases to effectively train machine learned interatomic potentials",
        "Project UID": "MD04",
        "Name of Professor ": "Sudarshan Vijay",
        "Project Description": "This project focuses on using computer simulations and machine learning to study chemical reactions in heterogeneous catalysis and electrochemistry. \n\nVery accurate simulations using methods such as density functional theory (DFT) are used to understand how atoms behave during reactions. These methods are predictive and accurate but take a lot of computing time and can only look at very small systems over very short times. \n\nIn chemical processes, things happen over longer times and over larger length scales. Using machine learning methods, we can train models, called machine-learned interatomic potentials (MLIPs) to accelerate DFT calculations. However, to make these models reliable, they must be trained on a good mix of atomic structures that reflect all the different ways atoms can be arranged.  In this project, we’ll explore two methods to help pick out the best atomic structures to train our models:\n(1) Bayesian methods – which help estimate how confident the model is in its predictions.  (2) Committee methods with neural networks – where multiple models “vote” to decide what data is most useful to learn from.  \n\nWe’ll test these methods on materials like metal oxides and systems involving water and ions. By the end, we’ll compare both approaches to see which one works better and why. ",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "This project is well suited for students interested in developing and applying machine learning models in the context of the chemical sciences. Prior experience in DFT calculations and machine learning techniques is not required. Basic knowledge of programming will be useful but can be picked up during the project. ",
        "Duration": "2-3 months",
        "Learning Outcome & Expectations from the students": "We will understand how to compute and determine errors in machine learning algorithms such as kernel based methods and neural networks. We will understand how determining these errors allow us to predict the outcomes of chemical reactions.",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "5-8",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CHEMISTRY\nBSBE\nAI/ML\nMULTIDISCIPLINARY",
        "Project Title": "Next-Gen Drug Discovery: Generative and Reinforcement Learning for Designing Anticancer Molecules",
        "Project UID": "MD05",
        "Name of Professor ": "Debabrata Maiti",
        "Project Description": "This project explores the fusion of generative AI and reinforcement learning to design novel anticancer molecules with optimal biological and chemical properties. Students will leverage real datasets of known drug candidates and molecular interactions to train deep learning models capable of generating new, synthesizable compounds. The reinforcement learning agent will fine-tune these designs based on predicted ativity(IC₅₀) values, docking scores, and drug-likeness filters. The project builds on cutting-edge cheminformatics techniques developed in our lab — including molecular embeddings, SMILES-to-property models, and structure-based predictions, creating a rich, hands-on experience at the intersection of chemistry and AI. Ideal for those passionate about AI-for-health, molecular modeling, and impactful interdisciplinary science.",
        "Number of Students Required": "5",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Basic knowledge of Python. Familiarity with machine learning frameworks (e.g., PyTorch, TensorFlow) and an interest in drug discovery,  bioinformatics is recommended.",
        "Duration": "3-4 Months",
        "Learning Outcome & Expectations from the students": "Students will gain hands-on experience in deep learning for molecular generation, reinforcement learning for optimization, and cheminformatics-driven drug discovery. They will build pipelines from data preprocessing to model deployment and understand how AI can accelerate biomedical innovation and also publish the work in a higher impact journal.",
        "Student required to stay on campus:": "Hybrid preferred — initial week on campus, then remote possible.",
        "Weekly Time Commitment": "15 -20 hours",
        "Any other expectation from the students": "Students should be self-driven, consistent, and curious. They should be comfortable learning new tools and discussing ideas regularly with the mentor and team. A passion for interdisciplinary research is strongly encouraged."
    },
    {
        "Domain": "CHEMISTRY\nBSBE\nAI/ML\nMULTIDISCIPLINARY",
        "Project Title": "Generative Language Models for Target-Specific Drug Discovery",
        "Project UID": "MD06",
        "Name of Professor ": "Debabrata Maiti",
        "Project Description": "This project applies generative language models (LLMs) to accelerate the early stages of drug discovery. Students will work with SMILES data, protein targets, and molecular properties to train or fine-tune LLMs that can generate novel small molecules with anticancer or disease-specific properties. The workflow includes prompt-based generation, filtering via activity prediction, and evaluation using docking scores or QSAR models. Tools like ChemCrow, SELFIES, and Hugging Face transformers will be utilized. The end goal is to create a DrugGPT assistant that proposes target-aligned drug candidates with high therapeutic potential. This project is ideal for students excited about AI-for-health, molecular generation, and transformer-based chemistry models.",
        "Number of Students Required": "5",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Basic Python, familiarity with NLP or ML frameworks (e.g., PyTorch, Hugging Face). Interest in drug discovery or bioinformatics is a bonus.",
        "Duration": "2-3 Months",
        "Learning Outcome & Expectations from the students": "Students will learn to fine-tune and prompt LLMs for chemistry applications, explore molecule generation with drug-likeness filters, and build generative AI tools for bioactive compound design.",
        "Student required to stay on campus:": "Hybrid preferred — initial week on campus, then remote possible",
        "Weekly Time Commitment": "15-20 hours",
        "Any other expectation from the students": "Students should be curious, self-motivated, and interested in applying cutting-edge AI to real drug discovery challenges. Willingness to explore chemical NLP and generative modeling is a plus."
    },
    {
        "Domain": "CHEMISTRY\nAI/ML\nMULTIDISCIPLINARY",
        "Project Title": "CatalystGPT: Using LLMs to Decode and Generate Catalytic Systems",
        "Project UID": "MD07",
        "Name of Professor ": "Debabrata Maiti",
        "Project Description": "This project leverages generative AI and large language models (LLMs) such as GPT and SciBERT to revolutionize catalyst discovery in homogeneous catalysis. Students will curate and feed mechanistic data, reaction protocols, and ligand libraries into transformer models trained on chemical literature. Using prompt engineering and fine-tuning, the models will generate novel ligand candidates, propose reaction conditions, and even summarize mechanistic pathways. The goal is to build a Catalyst Design Assistant that understands chemical language and can suggest innovative directions for experimental chemistry.\nThe project blends natural language understanding with generative molecule-level insights, offering students a hands-on role in shaping the future of AI-assisted research. Prior chemistry expertise is welcome but not essential—what matters is a passion for using LLMs to solve real scientific problems. This project offers a truly interdisciplinary experience at the interface of language, learning, and lab-based catalysis.\n",
        "Number of Students Required": "5",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Python + basic NLP or ML knowledge. Experience with Hugging Face or transformers is a bonus.",
        "Duration": "2–3 months (Summer 2025)",
        "Learning Outcome & Expectations from the students": "Students will learn fine-tuning and prompting strategies with LLMs, connect chemistry with text modeling, explore data mining for catalyst design and also publishing in a good impact factor journal.",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "15-20 hours",
        "Any other expectation from the students": "Students should enjoy working at the intersection of chemistry and AI/NLP, and bring curiosity to prompt-based exploration."
    },
    {
        "Domain": "CHEMISTRY\nAI/ML\nMULTIDISCIPLINARY",
        "Project Title": "Contrastive Graph Learning for Reactivity Prediction",
        "Project UID": "MD08",
        "Name of Professor ": "Debabrata Maiti",
        "Project Description": "This project uses graph neural networks (GNNs) and contrastive learning to learn representations of ligands from molecular graphs. Students will build triplet loss–based embedding models that distinguish between low- and high-yield ligands in chemical reaction systems. Embeddings will power downstream classification and regression models for reactivity prediction. Perfect for students excited by graph ML, chemical representation learning, and AI-guided reaction discovery.",
        "Number of Students Required": "5",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Python, deep learning (PyTorch), and basic graph theory. ",
        "Duration": "2-3 months",
        "Learning Outcome & Expectations from the students": "Students will learn to build GNNs, triplet loss models, and apply them to molecular reactivity. They will also work with real chemical reaction data.",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "15-20 hours",
        "Any other expectation from the students": "Must be comfortable exploring new ML architectures and working with molecular graph datasets."
    },
    {
        "Domain": "CHEMISTRY\nAI/ML\nMULTIDISCIPLINARY",
        "Project Title": "MolVision — AI-Powered Molecule Analysis from Chemical Structure Images",
        "Project UID": "MD09",
        "Name of Professor ": "Debabrata Maiti",
        "Project Description": "This project combines computer vision and molecular science to create an AI model that converts chemical structure images into SMILES or molecular graphs. Students will work on CNN or vision transformer architectures trained on hand-drawn and textbook-style molecule datasets. Applications include digitizing legacy chemistry papers and developing drawing-to-structure assistants. An exciting project for those interested in vision, image recognition, and molecular analysis.",
        "Number of Students Required": "5",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Python, computer vision (PyTorch/TensorFlow), ",
        "Duration": "2-3 months",
        "Learning Outcome & Expectations from the students": "Students will learn image processing, deep learning for structure recognition, and build tools that interface between image and molecular data.",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "15-20 hours",
        "Any other expectation from the students": "They should be excited about AI for science, creative with real-world applications, and capable of self-directed learning."
    },
    {
        "Domain": "CIVIL\nAI/ML\nMULTIDISCIPLINARY",
        "Project Title": "Development of a machine learning model to evaluate the creep deflection in PSC bridges",
        "Project UID": "MD10",
        "Name of Professor ": "Najeeb Shariff Mohammad",
        "Project Description": "The project aims at developing an ML based model to predict the creep compliance function of different types of concretes from an already available test database. Using the ML predicted compliance values for different ages, the prediction of creep deflection would be estimated at two stages (i) during construction, and (ii) end of design life. Based on the deflections, the residual capacity of the PSC bridge girders would be evaluated.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "An exposure to ML course, programming skills (preferably in MATLAB or Python)",
        "Duration": "2-4 months ",
        "Learning Outcome & Expectations from the students": "The students get to learn real life implementation of machine learning in bridge construction and bridge maintenance activity which ensures safe life of the bridge. The students will also have an opportunity to learn and compare new ML algorithms. Additionally, students will get to implement the ML program on a UI based platform.",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "20 hours per week during the vacation and 8 hours per week during the semester (if the project spills over)",
        "Any other expectation from the students": "Commitment, enterprising and sincerity at work."
    },
    {
        "Domain": "CLIMATE STUDIES\nCOMPUTER SCIENCE\nMULTIDISCIPLINARY",
        "Project Title": "Bringing Simulated Forests to Life: Building a Visual Twin for the Plant-FATE Vegetation Model",
        "Project UID": "MD11",
        "Name of Professor ": "Jaideep Joshi",
        "Project Description": "What if you could watch a forest grow—tree by tree, from seedling to canopy—based on real ecological processes? This project aims to develop a visual twin for Plant-FATE (Plant Functional Acclimation and Trait Evolution), a state-of-the-art eco-evolutionary vegetation model that simulates the 3D structure, growth, and function of individual trees and ecosystems. You'll build a walk-through visualization of simulated forests that evolves in real time with the model, helping researchers explore forest dynamics in a more intuitive and immersive way. The work involves coupling C++/OpenGL-based graphics with a numerical simulation, and is ideal for students with strong C++ programming skills and an interest in 3D graphics or scientific visualization. More info here: https://treehouse-iitb.github.io/join_us.html\n",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7.5",
        "Prerequisites": "Knowledge of C++ and OpenGL (or equivalent Graphics Libraries)",
        "Duration": "3-5 Months",
        "Learning Outcome & Expectations from the students": "3D Graphics and Visualization Techniques, Model-Visualization Integration, Procedural computer graphics",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "20",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CLIMATE STUDIES\nCOMPUTER SCIENCE\nMULTIDISCIPLINARY",
        "Project Title": "Predicting the Future of Forests: Numerical Steady-State Solver for an Eco-Evolutionary Global Vegetation Model",
        "Project UID": "MD12",
        "Name of Professor ": "Jaideep Joshi",
        "Project Description": "How will forests around the world respond to climate change? This question is central to predicting the global carbon cycle and developing effective mitigation strategies. In this project, you'll contribute to Plant-FATE (Plant Functional Acclimation and Trait Evolution), a cutting-edge vegetation model that simulates how plants grow, compete, and evolve over time. The model already performs well in the Amazon, and now we're working to scale it up globally by solving directly for long-term steady states—skipping the time-consuming simulations of transient dynamics. If you enjoy working with mathematical models and have experience in C++ programming, this is a great opportunity to apply those skills to an important real-world problem. More info here: https://treehouse-iitb.github.io/join_us.html",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Good knowledge of differential equations, C++ programming",
        "Duration": "3-5 months",
        "Learning Outcome & Expectations from the students": "Numerical Modeling Skills, Scientific Programming in C++, Understanding of Ecosystem and Climate Interactions",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "25",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "CLIMATE STUDIES\nAI/ML\nMULTIDISCIPLINARY",
        "Project Title": "Forecasting Monsoon Precipitation with FourCastNet ",
        "Project UID": "MD13",
        "Name of Professor ": "Vishal Dixit",
        "Project Description": "FourCastNet short for Fourier Forecasting Neural Network, is a global data-driven weather forecasting model that provides accurate short to medium-range global predictions at 0.25∘ resolution. FourCastNet, accurately forecasts high-resolution, fast-timescale variables such as the surface wind speed, precipitation, and atmospheric water vapor. While a key advancement in weather forecasting globally, this model has not been evaluated for its ability to reproduce the monsoon precipitation variability. The key datasets used to train FourCastNet are known to have limitation in reproducing the observed variability of Monsoon rainfall. This project will evaluate ability of FourCastNet to reproduce monsoon rainfall and propose methods to enhance its performance.\nKey reference: https://arxiv.org/pdf/2202.11214\n",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "- Strong background in Machine learning, Data science, and programming\n- Interest in atmospheric sciences or meteorology is a plus\n- Highly motivated with problem-solving skills and a collaborative mindset",
        "Duration": "4-6 months",
        "Learning Outcome & Expectations from the students": "1.\tLearning about cloud making processes and ML algorithms from a team of experts in atmospheric sciences and computation sciences\n2.\tExperience with Big Climate Data handling\n3.\tScientific documentation methods\n",
        "Student required to stay on campus:": "Physical meetings required once in 2 weeks.",
        "Weekly Time Commitment": "16-18 hrs",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "COMPUTER SCIENCE,\nMEMS\nMULTIDISCIPLINARY",
        "Project Title": "Materials Thermal Project",
        "Project UID": "MD14",
        "Name of Professor ": "Ankit Jain",
        "Project Description": "We are aiming to build something similar to: https://next-gen.materialsproject.org/materials\nThe project involves front-end and backend development of a database hosting platform to serve users with thermal conductivity data generated in our group in past 5 years. The platform will also allow users to submit new calculations directly via the web interface.",
        "Number of Students Required": "4",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Experience with either frontend or backend development. Frontend Tools: any ope-source including Reactx. Backend: Python-Flask",
        "Duration": "6 - 12 months",
        "Learning Outcome & Expectations from the students": "Development of fully functional database platform for scientific research community",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "10",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "ELECTRICAL\nAI/ML\nMULTIDISCIPLINARY",
        "Project Title": "Data Sanitization in Artificial Intelligence",
        "Project UID": "MD15",
        "Name of Professor ": "Prof Sandip Mondal",
        "Project Description": "Erasing information as a form of data from NAND flash memories suffers heavy overheads. Present resolutions comprise disconnecting the physical page addresses which makes data unreachable through typical lines, nevertheless, they bring the risk of data leakage. The SLC NAND flash memories have been. Data overwrite has been proposed with all-zero-in-place which is only applicable to the SLC NAND flash memories. This proposal introduces an immediate page data sanitization method for 3D MLC NAND flash memory devices that avoids leakage of erased information without any adverse effects on effective data in shared pages",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8.5",
        "Prerequisites": "Strong backgroup of Python",
        "Duration": "1 year",
        "Learning Outcome & Expectations from the students": "3D NAND flash memory for Artificial Intelligence, Patent and International (USA) presentation",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "20 Hrs",
        "Any other expectation from the students": "https://www.youtube.com/watch?v=45HAfu719iw"
    },
    {
        "Domain": "ELECTRICAL\nMECHANICAL\nMULTIDISCIPLINARY",
        "Project Title": "Development of embedded hardware and software (using TIVA) for innovative microneedle printing machine ",
        "Project UID": "MD16",
        "Name of Professor ": "Prasanna Gandhi",
        "Project Description": "Innovative techonology and process of microneedle fabrication has been established successfully in our laboratory at IIT Bombay. This project proposes development of embedded hardware board (with TIVA shield) using EAGLE or equivalent software and programming corresponding interfaces for printing the desired array of microneedles in a patch template. Mechanical part involves putting together xy motion stages, optical shutter, mirrors and lenses together in the system in a robust and user friendly manner.  ",
        "Number of Students Required": "1 (mechanical), 1 (electrical)",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Prior background on microcontroller programming and PCB design for EE required and hands on project for ME required. ",
        "Duration": "60 days",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "40",
        "Any other expectation from the students": "sincerity and ethics "
    },
    {
        "Domain": "ELECTRICAL\nSYSCON\nMULTIDISCIPLINARY",
        "Project Title": "Microrobotics",
        "Project UID": "MD17",
        "Name of Professor ": "Ashwin A. Seshia",
        "Project Description": "This project will involve the design of piezoelectric actuators for milli-scale robots. The project will commence with surveying the literature in the field and associate models for the actuators and robot structures. The insight generated will be applied to the design of prototype devices based on off-the-shelf actuators and bench-level encapsulation/packaging methodologies. The project if successful may be continued over the semester period.",
        "Number of Students Required": "1-2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7.8",
        "Prerequisites": "Interview will be held for selection.",
        "Duration": "2-3 months",
        "Learning Outcome & Expectations from the students": "modeling, design, fabrication, packaging, and encapsulation of microelectromechanical devices and systems.",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "40",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "ENERGY\nCLIMATE STUDIES\nMULTIDISCIPLINARY",
        "Project Title": "Visualizing climate impact: a dashboard for spotting hotspots in cities",
        "Project UID": "MD18",
        "Name of Professor ": "Karthik Sasihithlu",
        "Project Description": "Our research group has developed a methodology to extract local land surface temperatures (LST) from freely available satellite imagery, including data from LANDSAT and MODIS platforms. This approach enables high-resolution, city- and ward-level mapping of temperature variations, allowing us to monitor the impacts of urbanization, concretization, and vegetation loss on microclimatic conditions.\n\nTo make this information accessible and actionable for the general public, we will be developing an interactive online dashboard that will feature approximately 20 major Indian cities. The key features of this dashboard will include:  a) Daily updates of land surface temperature data, sourced from satellite imagery. b) Ward-wise average LST maps to highlight local variations within cities. c) Hot spot cluster identification, updated in near real-time, to indicate zones experiencing critical heat stress. d) Time-series plots showing the evolution of land surface temperatures in specific regions or localities over the past 20 years, helping to illustrate long-term urban heat trends.  This tool will serve as a public-facing platform for climate awareness, enabling citizens, researchers, and policymakers to track urban heat island effects and assess the consequences of changing land use patterns at a highly localized level.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year",
        "CPI Eligibility Criteria": "above 6",
        "Prerequisites": "Prior experience in user interface (UI) development is highly desirable. The project requires building an interactive dashboard, and candidates are expected to be self-sufficient in this aspect.\n\nFamiliarity with web development frameworks will be a significant advantage.\n\nExperience in working with geospatial data (especially satellite imagery from platforms like LANDSAT or MODIS) is a plus.\n\nKnowledge of tools such as Google Earth Engine, QGIS, or GDAL will be considered beneficial.",
        "Duration": "2-3 months",
        "Learning Outcome & Expectations from the students": "Using satellite imagery to extract useful information such as land surface temperature, vegetation etc.  Awareness about ongoing efforts to combat long term climate-change effects ",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "20 hours",
        "Any other expectation from the students": "Please join only if you are truly interested in contributing. \nWe are answerable to the funding agency, and will be affected if students join only for namesake.  There will be weekly meetings too"
    },
    {
        "Domain": "ENERGY\nMECHANICAL \nMULTIDISCIPLINARY",
        "Project Title": "Data driven analysis of fluid drag on irregularly shaped particles",
        "Project UID": "MD19",
        "Name of Professor ": "Manaswita Bose",
        "Project Description": "The objective of the project is to develop drag correlations based on simulation results. Preliminary CFD simulations with body fitted mesh will be performed using standard software. The data generated using these simulations will be used for the analysis or development of correlations. ",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 3rd year",
        "CPI Eligibility Criteria": "none",
        "Prerequisites": "Fluid Mechanics and interest in computer coding",
        "Duration": "two months",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "The student may work from home; however, weekly reporting is expected",
        "Weekly Time Commitment": "40",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "MECHANICAL ENGINEERING\nAI/ML\nMULTIDISCIPLINARY",
        "Project Title": "ML based object detection for security scanning systems using high energy beams",
        "Project UID": "MD20",
        "Name of Professor ": "Rakesh Mote",
        "Project Description": "This is collaborative project wherein high energy beams being utilized for hidden object detection via image/spectra analysis.",
        "Number of Students Required": "1-2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "Above 7.5",
        "Prerequisites": "Understanding of data analysis, ML algorithms. Some knowledge of image processing would be an advantage.",
        "Duration": "2-6 months",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Some field work in the Navi Mumbai based high energy beam facility ",
        "Weekly Time Commitment": "At least 2-3 days per week on the field during summer",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "MEMS\nCHEMICAL\nMULTIDISCIPLINARY",
        "Project Title": "Recycling of Urban Ores (spent Li-ion batteries/Solar panel/Magnet)",
        "Project UID": "MD21",
        "Name of Professor ": "Jayasree Biswas",
        "Project Description": "Urban ores—such as spent lithium-ion batteries and waste solar panels—contain substantial amounts of valuable metals that are classified as critical minerals by the Ministry of Mines. Improper disposal of these materials can lead to the release of toxic substances, posing environmental and health risks. Therefore, recycling and recovering metals from urban ores is essential to support material circularity and ensure a stable supply chain. This project will focus on exploring pyro- and hydro-metallurgical processes through experimental investigations and material characterization. ",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "From Chemical/Metallurgy",
        "Duration": "2 months",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "Around 20-30 hours",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "MATHEMATICS\nCOMPUTER SCIENCE\nMULTIDISCIPLINARY",
        "Project Title": "Modeling and solving combinatorial optimization models using Minotaur solver",
        "Project UID": "MD22",
        "Name of Professor ": "Ashutosh Mahajan",
        "Project Description": "Minotaur is an open-source solver for combinatorial and nonlinear optimization models that arise in various practical applications including logistics. One goal would be to understand and develop plans for movements of trucks in a logistics network so that periodic demands are efficiently transported over long distances. Consolidated movements that are cost effective, and also satisfy time requirements of deliveries are the performance measure in this case. Innovative heuristics that may require parallel search on multiple CPUs or a GPU can be tried.",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7.5",
        "Prerequisites": "Student should have interest in mathematical optimization and computing. Student should be comfortable in programming C++, Julia or Python.",
        "Duration": "About two months",
        "Learning Outcome & Expectations from the students": "The student will learn how to model and solve optimization models discrete variables that arise in many practical applications. They will understand some algorithms (exact and heuristics) for such models. They will gain proficiency in implementing and testing them.",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "20",
        "Any other expectation from the students": "The student is expected to work closely with PhD and MTech students in the professor's group."
    },
    {
        "Domain": "MULTIDISCIPLINARY",
        "Project Title": "Keeping track of traffic on campus",
        "Project UID": "MD23",
        "Name of Professor ": "Ronnie Sebastian",
        "Project Description": "I am interested in using tools available to solve some real life problems. One of the issues which I face, and others face too, is the increasing amount of traffic on campus. I want to develop some tool using which we can keep track on the number of vehicles on campus at any given time. Theoretically, this can be easily achieved using available tools. However, I would like to work this out in the specific instance of IIT-B campus. ",
        "Number of Students Required": "3",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8.5",
        "Prerequisites": "Good communication skills, you should be someone who respects his/her commitments, resourceful. ",
        "Duration": "Not sure.",
        "Learning Outcome & Expectations from the students": "It may give us an idea of how to go about solving real life problems. I guess there are many such problems around us, waiting to be solved, and so this experience may be a useful and interesting one. ",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "30. I am assuming you will not be doing any other project, and so you should be able to put in about 6 hours per day, 5 days a week. ",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "SYSCON\nENERGY\nMULTIDISCIPLINARY",
        "Project Title": "High-performance motor drive systems for electric vehicle applications",
        "Project UID": "MD24",
        "Name of Professor ": "S Ravi Prakash Reddy",
        "Project Description": "The adoption of electric vehicles (EVs) is increasing globally due to various environmental concerns. The core element in EVs, apart from EV battery, is the motor drive system that replaces internal combustion engine. The most widely used machines for EV applications are induction machines (IM), permanent magnet synchronous machines (PMSM), brushless DC (BLDC) machines and reluctance machines. In this project, the modelling, speed control and closed loop controller design aspects of  EV drives will be carried out, with a scope for employing high-performance control schemes that maintain robustness as well as transient performance characteristics.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Prior knowledge in the area of motor drives and control systems will be helpful",
        "Duration": "3-6 months",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "3",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "SYSCON\nENERGY\nMULTIDISCIPLINARY",
        "Project Title": "System Identification/Parameter Estimation Using Optimisation Techniques",
        "Project UID": "MD25",
        "Name of Professor ": "S Ravi Prakash Reddy",
        "Project Description": "Accurate knowledge of system parameters becomes very important in various applications. Estimating these parameters using optimisation methods involves minimising cost/objective function by iteratively estimating the model parameters. Accurate convergence of parameters being estimated becomes a major concern, especially while dealing with complex dynamic systems. This project aims to investigate various optimisation techniques to accurately estimate parameters of a physical system, using both the time domain and frequency domain approaches. ",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Knowledge in the area of control systems and optimisation techniques is desirable",
        "Duration": "3-6 months",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "3",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "SYSCON\nMATHEMATICS\nMULTIDISCIPLINARY",
        "Project Title": "Gradient approaches to optimal function learning",
        "Project UID": "MD26",
        "Name of Professor ": "Debasish Chatterjee",
        "Project Description": "An open problem in signal processing posed in 1977 demanded a numerically viable algorithm to solve the optimal function learning (interpolation) problem. A solution was recently offered in https://doi.org/10.1016/j.sysconle.2023.105648 (arXiv version https://arxiv.org/abs/2307.01304), building on some recent developments in convex semi-infinite programs. Such semi-infinite programs are NP hard; however, some NP hard problems admit excellent approximations, and the optimal function learning problem is one such. This project is directed at the development gradient approaches to solving the optimal function learning problem up to pre-assigned accuracy.\n\nPreliminary results in this direction (using nonsmooth gradient methods) have demonstrated, on average, several hundred fold improvement in performance on 67 benchmark problems relative to state-of-the-art solvers. The ideas may be employed, among other things, to develop a new class of methods for signal in-painting, e.g., optimal inpainting for corrupted audio signals, etc.",
        "Number of Students Required": "3",
        "Year of Study Criteria": "Students entering 2nd year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Sufficient mathematical maturity and seriousness. Students will need time to absorb the material and it is not easy.",
        "Duration": "Minimum 1 year.",
        "Learning Outcome & Expectations from the students": "Solid grounding in cutting-edge techniques of variational analysis, stability of constrained optimization, and function learning. Our objective is to develop new algorithms and techniques, and the project will require serious and sustained dedication over at least 1 year.",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "20 hr during the summer and at least 8 hr during the semester.",
        "Any other expectation from the students": "Only serious students interested in learning the subject may consider applying. This is not a project that will lead to quick outcomes."
    },
    {
        "Domain": "MECHANICAL ENGINEERING",
        "Project Title": "Computational investigation of droplet interaction with inclined hot plate",
        "Project UID": "ME01",
        "Name of Professor ": "Abhijeet Kumar",
        "Project Description": "This topic is in context of Infrared Suppression System (IRSS) for naval ships where spray is introduced in hot plume gas flow to cool them down. However, some of the drops interact with hot wall of the exhaust duct of naval ships. This works aims to explore this mechanism.",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Student should have crystal clear understanding of fluid mechanics and thermodynamics. Knowledge about simulation through ANSYS Fluent or COMSOL is preferable. ",
        "Duration": "1 year",
        "Learning Outcome & Expectations from the students": "Student will come to understand how a fundamental concept is applied to the practical problems and resolve those problems.",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "6-8",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "MECHANICAL ENGINEERING",
        "Project Title": "In situ velocity measurement of high speed bullets using optical velocity gate or chronograph.",
        "Project UID": "ME02",
        "Name of Professor ": "Krishna Jonnalagadda",
        "Project Description": "In this project, the student will develop mechanical, optical and electronic hardware based on either NI or Arduino platforms to measure the horizontal and vertical velocity of a bullet flying inside a tube.",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Some knowledge of electrical circuits, programming in Arduino IDE or NI Labview, CAD modeling are required.",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "System integration and hardware-software development to measure physical quantities relevant to industry and R&D. ",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "30",
        "Any other expectation from the students": "Should work in the lab in collaboration with other students."
    },
    {
        "Domain": "MECHANICAL ENGINEERING",
        "Project Title": "Smart phone based flow visualization for indoor air quality monitoring",
        "Project UID": "ME03",
        "Name of Professor ": "Manaswita Bose",
        "Project Description": "Indoor air quality is important for a healthy learning environment. The objective of the project is to develop a simple flow visualization toolkit to understand the air flow in a classroom/lab under different ventilation condition and relate that to the droplet deposition and transportation. \nThe simple measurement technique developed may also have other application areas.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Interest in experiments and exploring new ideas",
        "Duration": "summer months (May-July)",
        "Learning Outcome & Expectations from the students": "Experimental method to measure fluid flow using simple tools.",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "30-40 hours",
        "Any other expectation from the students": "Weekly update"
    },
    {
        "Domain": "MECHANICAL ENGINEERING",
        "Project Title": "Implementation of servo control for ball screw system using STM 32 microcontroller",
        "Project UID": "ME04",
        "Name of Professor ": "Prasanna Gandhi",
        "Project Description": "Ball screw drive system with servomotor as actuator and encoder on output stage as sensor has been developed at our laboratory for high precision application. This project involves simulation and practical implementation several control algorithms and comparison of their effectiveness in achieving the desired precision positioning goal. Solid foundation in microcontroller programming and automatic control is required for the project (ME 310 or equivalent and ME 311 or equivalent should have been completed).  Trajectory tracking would be further needed to be implemented. ",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "YES + ME 310 or equivalent and ME 311 or equivalent should have been completed and inclination towards experimental work. Well grounded in fundamentals. ",
        "Duration": "2 months",
        "Learning Outcome & Expectations from the students": "thorough knowledge in practical implementation of control algorithms handling sticky issues such as friction. ",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "40 hrs min in the suman mashruwala advanced micro-engineering laboratory. ",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "MECHANICAL ENGINEERING",
        "Project Title": "Dynamics of Kirigami Metamaterials",
        "Project UID": "ME05",
        "Name of Professor ": "R. Ganesh",
        "Project Description": "Metamaterials are a class of artificially designed structures whose properties are a function of the constituent material, as well as the geometry/topology of the structure. For example, an auxetic 2D-Lattice subjected to a uniaxial stretch expands in the orthogonal direction, thereby demonstrating an effective “negative” Poisson’s ratio (in contrast, the constituent material has a positive Poisson’s ratio). Since the architecture or geometry plays an important role in the unconventional properties, Kirigami, the art of cutting paper to form 3-D shapes starting from 2-D sheets has been found to be quite relevant to the design of mechanical metamaterials. Specifically, application of load to a 2-D sheet architected with small cuts induces out-of-plane buckling of the individual links, and results in the introduction of bending stiffness to the structure (which is negligible in the uncut specimen due to its negligible thickness). An interesting application of these structures is in the field of soft robotics, where shape morphing is employed to elicit locomotion through deformation. However, most studies focus only on rectilinear locomotion. In this project, we will intend to explore the ability to achieve shape morphing and realize various modes of deformation-induced locomotion (such as bending/twisting) through a localized dynamic excitation and making it completely reversible.",
        "Number of Students Required": "1-2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "At least BB or above in ME 223 (or equivalent). ",
        "Duration": "Two Months. Can continue as SLP/BTP based on progress.",
        "Learning Outcome & Expectations from the students": "Advanced Finite Element Analysis of structures used for Soft Robots. Experimental manufacturing and testing of Inflatable robotic structures.",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "20-40 hrs based on availability",
        "Any other expectation from the students": "Students will have to stay on campus during the summer. Further, they should not be involved in more than one additional project/group related work during the summer.  "
    },
    {
        "Domain": "MECHANICAL ENGINEERING",
        "Project Title": "Indusrty 4.0/IoT protocols for Ultra Precsion Manufacturing Industry",
        "Project UID": "ME06",
        "Name of Professor ": "Rakesh Mote",
        "Project Description": "Ultra precision manufacturing caters need of high-tech components for strategic, nuclear, astronomical applications. The project involves feasibility study to implement Industry 4.0 and IoT to ultra precision Manufacturing.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "Above 7.5",
        "Prerequisites": "Some exposure to solid modelling/VR packages, Mechatronics, LabVIEW interfacing or similar ",
        "Duration": "3-6M",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "Min 15 hrs",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "MECHANICAL ENGINEERING\n",
        "Project Title": "Modelling and Fabrication of Aspheric/Free-from Surfaces for X-ray Telescope",
        "Project UID": "ME07",
        "Name of Professor ": "Rakesh Mote",
        "Project Description": "Aspheric or  free-from surfaces are gaining popularity for various space, biomedical optics. The complex nature of the surfaces poses challenges in their modeling, fabrication and metrology. The project aims at quantification and tool path optimization of such surfaces.",
        "Number of Students Required": "1-2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "Above 7.5",
        "Prerequisites": "Sound understanding of mathematics/geometry, graphics, programming skills using matlab or python",
        "Duration": "2-6 months",
        "Learning Outcome & Expectations from the students": "",
        "Student required to stay on campus:": "Not for whole period, however, continuous interaction is needed",
        "Weekly Time Commitment": "Min 20 hours during summer",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "MECHANICAL ENGINEERING",
        "Project Title": "Automated Tool Wear Analysis",
        "Project UID": "ME08",
        "Name of Professor ": "Soham Mujumdar",
        "Project Description": "This project aims to develop cutting-edge algorithms combining machine learning and image processing to automate the analysis of optical images of cutting tools (drills, endmills, etc.). The primary goal is to accurately determine geometrical parameters (dia, angles, etc.) and detect tool wear. The project will involve data collection, image preprocessing, machine learning model training, and the creation of a user-friendly interface. \nRequirements, \n1.\tThe objective is to develop a software to determine geometrical parameters (dia, angles, etc.) and measure tool wear (in mm) from optical images. Here are the requirements, \na.\tMust work with images with different magnification levels (the images will include scale-bars)\nb.\tShould be automated with minimal user intervention and the ability to batch-process\nc.\tAchieve measurement accuracy within a tolerance of less than 10%, validated through verification on ten randomly selected test images.\n2.\tStudents have the flexibility to choose any tools or technologies to fulfill the specified requirements. Sample images will be provided initially for development and testing purposes. In the event that a substantial number of images are necessary, it is the responsibility of the students to collect the additional images required for the project.\n3.\tStudents are required to submit regular progress reports at least once every two weeks.\n4.\tUntil project deliverables are successfully met, students are not permitted to include this project on their resumes/CVs.\n5.\tThe developed software will be released as open source. ",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Sufficient knowledge of coding and image processing.",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "Hands-on experience of working on a real-world problem, image processing skills, research experience",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "4",
        "Any other expectation from the students": "Students are required to submit regular progress reports at least once every two weeks.\nUntil project deliverables are successfully met, students are NOT permitted to include this project on their resumes/CVs and will NOT be provided any LoR.\n"
    },
    {
        "Domain": "MECHANICAL ENGINEERING",
        "Project Title": "Image-Based Characterization of Coatings",
        "Project UID": "ME09",
        "Name of Professor ": "Soham Mujumdar",
        "Project Description": "Students will be responsible for developing and applying advanced image processing techniques to analyse surfaces and coatings. The goal is to extract meaningful surface characteristics from image data.\n \nSubtasks 1: Coating Thickness Estimation\n Develop image processing algorithms to estimate coating thickness in the micron range from high-resolution surface images.\n \nSubtasks 2: Surface Roughness Prediction\nUse statistical methods (or ML) to predict surface roughness parameters based on image features. Correlate image-based predictions with physical measurements (e.g., Ra, Rz).\n \nSubtasks 3: Image Segmentation\nImplement image segmentation techniques to distinguish coated regions, defects, or different surface zones.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Sufficient knowledge of coding and image processing. ",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "Hands-on experience of working on a real-world problem, image processing skills, research experience",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "4",
        "Any other expectation from the students": "Students are required to submit regular progress reports at least once every two weeks.\nUntil project deliverables are successfully met, students are NOT permitted to include this project on their resumes/CVs and will NOT be provided any LoR."
    },
    {
        "Domain": "MECHANICAL ENGINEERING",
        "Project Title": "Robotic Additive Manufacturing and Coating",
        "Project UID": "ME10",
        "Name of Professor ": "Soham Mujumdar",
        "Project Description": "The project requires the student to develop interface to convert the part drawing into a tool path in the robot-specific language. It will be used to 3D print complex metallic components or to create polymer coatings over complex surfaces.  ",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Should have a good knowledge of robotics, controls, electronics, data acquisition, CNC",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "Hands-on experience of working on a real-world problem, image processing skills, research experience",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "8 hrs",
        "Any other expectation from the students": "Students are required to work with graduate students in the lab and submit regular progress reports at least once every two weeks.\nUntil project deliverables are successfully met, students are NOT permitted to include this project on their resumes/CVs and will NOT be provided any LoR."
    },
    {
        "Domain": "MECHANICAL ENGINEERING",
        "Project Title": "Design and Fabrication of a Torso Segment Constrained in a plane using Air Bearing.",
        "Project UID": "ME11",
        "Name of Professor ": "Vivek Sangwan",
        "Project Description": "For testing walking control algorithms, walking are robots are constrained to walk in a plane. The goal of this project is perform electrical, mechanical and pneumatic design and fabrication of a torso module of the biped constrained in to move in a single plane using air bearings between against glass surfaces.",
        "Number of Students Required": "3",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "No per-requisites but experience in mechanical design will be a plus",
        "Duration": "Summer",
        "Learning Outcome & Expectations from the students": "Mechatronics Design and Fabrication Skills",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "20",
        "Any other expectation from the students": "Willingness to independently read and understand material relevant to project and use it to implement ideas."
    },
    {
        "Domain": "MEMS",
        "Project Title": "Strain measurement in functional thin films using geometric phase analysis",
        "Project UID": "MM01",
        "Name of Professor ": "Abhinandan Gangopadhyay",
        "Project Description": "Strain-engineering of thin films is useful for various optoelectronic device applications such as solar cells, lasers, infrared photodetectors, etc. This project aims to measure nanoscale strain in novel functional thin films. Geometric phase analysis (GPA) of dot-like high-resolution (scanning) transmission electron microscope images will be utilized to map strain field at nanometer-scale. Two non-colinear reciprocal lattice vectors will be masked in Fourier space and the phase components of the Bragg filtered images will be used to generate displacement and strain map. The reliability of the generated strain maps will be evaluated by detailed consideration of sources of errors.",
        "Number of Students Required": "1-2",
        "Year of Study Criteria": "Students entering 2nd year, Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Beginner level image processing experience will be useful. ",
        "Duration": "2.5 months",
        "Learning Outcome & Expectations from the students": "Strain analysis in thin films",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "40",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "MEMS",
        "Project Title": "Simulation of microstructure evolution during metal additive manufacturing",
        "Project UID": "MM02",
        "Name of Professor ": "Durga A.",
        "Project Description": "Ever wondered what happens inside a material while it is being 3D printed? In this project, you will develop a model to predict the structure at the microscale when a metallic alloy is 3D printed using a fusion-based process. Predicting this microstructure will enable us to tailor the process to obtain a suitable microstructure that would provide the best possible properties and performance. The project will involve formulating a mathematical model to describe the evolution of the microstructure and then implementing the same in Python to predict the microstructure evolution in a real metallic alloy that is being 3D printed.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7.5",
        "Prerequisites": "Good math ability and basic programming skills",
        "Duration": "2 months",
        "Learning Outcome & Expectations from the students": "Ability to formulate a materials science problem mathematically and solve it numerically.",
        "Student required to stay on campus:": "No",
        "Weekly Time Commitment": "30",
        "Any other expectation from the students": "nil"
    },
    {
        "Domain": "MEMS",
        "Project Title": "Graphene based water/air filtration",
        "Project UID": "MM03",
        "Name of Professor ": "Shobha Shukla",
        "Project Description": "Graphene offers a versatile platform for the adsorption of various pollutants. Through this project, we plan to utilize graphene for trapping arsenic, iron and other floating pollutants. Extensive testing will be done to ensure trapping and degradation dynamics/mechanism. Finally prototype development will be done to check the applicability of the system. ",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7",
        "Prerequisites": "Electronics exposure would be good",
        "Duration": "6months",
        "Learning Outcome & Expectations from the students": "Materials, sustainable practices",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "30 -40 hours",
        "Any other expectation from the students": "sincerity and perseverance"
    },
    {
        "Domain": "PHYSICS",
        "Project Title": "Imaging with Compton scattered photons in Positron emission tomography",
        "Project UID": "PH01",
        "Name of Professor ": "Prof. Pragya Das",
        "Project Description": "Positron Emission Tomography (PET) is an advance imaging technique in nuclear medicine.  The image quality suffers from various types of noises, of which Compton scattering is a major component in degrading the image quality.  In the conventional PET, Compton scattered part is carefully estimated and discarded from the main data.  With the advent of list-mode data collection, it is possible to isolate the scattered events because the locus of the scattering point lies on a prolate surface.  Our idea is to construct images using the scattered events and later merge them with the main data.  So, instead of discarding the scattered data as noise, we can utilize them, thereby improving the signal to noise ratio significantly.  Developing models is one part of our project, and to apply various deconvolution techniques to improve the image quality is another one.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Computer programming, C-language, MATLAB, Monte Carlo simulation",
        "Duration": "2-3 months",
        "Learning Outcome & Expectations from the students": "To gain knowledge in Physics and computational aspects of biomedical imaging techniques.",
        "Student required to stay on campus:": "Partly stay in campus (say, 3-4 weeks).",
        "Weekly Time Commitment": "12 - 16 hours.",
        "Any other expectation from the students": "Academic honesty and keen desire to learn."
    },
    {
        "Domain": "PHYSICS",
        "Project Title": "Imaging with scattered photons with known time-of-flight in Positron emission tomography",
        "Project UID": "PH02",
        "Name of Professor ": "Prof. Pragya Das",
        "Project Description": "Positron Emission Tomography (PET) is an advance imaging technique in nuclear medicine.  Conventional PET employs various techniques to reject scattered data as it creates noise in the reconstructed image. Instead of discarding 30-60% of the coincidence events belonging to single-scattered (SS) category, we propose a novel algorithm that utilizes such events to generate images.  While previous studies in literature have explored SS imaging using both Time-of-Flight (TOF) and energy information, our approach extends this capability to plastic scintillators with only TOF information.  This proves particularly beneficial for low-count plastic PETs with very good timing resolution.  We plan to validate our model using experimental data from J-PET facility (Jagiellonian University, Poland).",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 8",
        "Prerequisites": "Computer programming, C-language, MATLAB, Monte Carlo simulation",
        "Duration": "2 - 3 months",
        "Learning Outcome & Expectations from the students": "Physics ideas utilized in Biomedical imaging",
        "Student required to stay on campus:": "Partly stay in campus (say 3 - 4 weeks)",
        "Weekly Time Commitment": "12 - 16 hours",
        "Any other expectation from the students": "Academic honesty and keen desire to learn."
    },
    {
        "Domain": "MANAGEMENT (SOM)",
        "Project Title": "Using NLP for financial text mining",
        "Project UID": "SOM01",
        "Name of Professor ": "Piyush Pandey",
        "Project Description": "NLP has made textual data mining easier for financial analyst for incorporating qualitative data into valuation, risk management, and developing profitable trading and investment strategies. The project entails extracting news from database, classification of news into various financial topics and characteristics measurement of news such as sentiment, relevance, complexity or ambiguity.",
        "Number of Students Required": "2",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "above 7.5",
        "Prerequisites": "Understanding of NLP",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "Application of NLP for text mining in the financial markets ",
        "Student required to stay on campus:": "Hybrid is fine but in person preferable",
        "Weekly Time Commitment": "12",
        "Any other expectation from the students": "Sincerity is a must and interest in financial markets. Basic Idea of NLP is must (CSE/EE preferable)"
    },
    {
        "Domain": "SYSCON",
        "Project Title": "RL based multiagent patrolling ",
        "Project UID": "SYS01",
        "Name of Professor ": "Arpita Sinha",
        "Project Description": "This project focuses on the patrolling problem where multiple vehicles visit some locations in a region repeatedly to ensure there is no security breach. The path planning and decision making algorithms have to be developed for these vehicles. A senior PhD student has developed a heuristic algorithm. We expect the intern to improve the algorithm by using RL-based methods. Knowledge of Python and ROS is required. We will be using SUMO for the simulations. ",
        "Number of Students Required": "1",
        "Year of Study Criteria": "Students entering 3rd year, Students entering 4th/5th year",
        "CPI Eligibility Criteria": "none",
        "Prerequisites": "Knowledge of Python and ROS.",
        "Duration": "3 months",
        "Learning Outcome & Expectations from the students": "(1) Developing multiagent algorithm using RL. \n(2) Knowledge of platforms like SUMO for testing.\n(3) Drafting manuscripts.",
        "Student required to stay on campus:": "Yes",
        "Weekly Time Commitment": "20 hours",
        "Any other expectation from the students": "Full commitment in the project. "
    }
]